
rate = str(input("อัตรา: "))
unit = int(input("จำนวนหน่วยที่ใช้: "))

cost=1
if rate=="111":
    print("อัตราปกติ ปริมาณการใช้พลังงานไฟฟ้าไม่เกิน 150 หน่วยต่อเดือน")
    if unit>100 :
        cost = (15*2.3488)+(10*2.9882)+(10*3.2405)+(65*3.6237)+((unit-100)*3.7171)
    elif unit>35:
        cost =(15*2.3488)+(10*2.9882)+(10*3.2405)+((unit-35)*3.6237)
    elif unit>25:
        cost =(15*2.3488)+(10*2.9882)+((unit-25)*3.2405)
    elif unit>15:
        cost=(15*2.3488)+((unit-15)*2.9882)
    else:
        cost=unit*2.3488

if rate =="112":
    if unit>400:
        cost=(150*3.2484)+(250*4.2218)+((unit-400)*4.4217)
    elif unit>150:
        cost=(150*3.2484)+((unit-150)*4.2218)
    else:
        cost=unit*3.2484
t=cost+8.19
ft=unit*(-0.1532)
vat=(t+ft)*1.07
print("\nส่วนที่ 1 ค่าไฟฟ้าฐาน")
print("ค่าพลังงานไฟฟ้า\t",'%.2f' % cost," บาท")
print("ค่าบริการ\t8.19 บาท")
print("รวมค่าไฟฟ้าฐาน\t",'%.2f' % t," บาท\n")
print("ส่วนที่ 2 ค่าไฟฟ้าผันแปร ( Ft )")
print("จำนวนพลังงานไฟฟ้า x ค่า Ft -0.1532\t",'%.2f' % ft," บาท")
print("\nส่วนที่ 3 ค่าภาษีมูลค่าเพิ่ม 7%")
print("(ค่าไฟฟ้าฐาน + ค่า Ft) +VAT 7%\t",'%.2f' % vat," บาท")







